<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"EKS","backend":"59c032247ef646029ce1fd31e067fbef39de863613239ef4a4c2c191d8532101","plan_job_ref":"Job tf-plan / Kabisa-playground-anas #16 at https://github.com/anasgrt/eks_project/actions/runs/8767892424","plan_out_hash":"5578a39fac2aef4a475989ac718df8de4670ff2c991ffe3ea74c591a75148c7a","plan_hash":"c70cb8904cf6a48c757f779ee44835d753b235f7ab2e4d73731c933c11267caf","plan_text_format":"diff-trunc","version":"1.42.0"} -->
Terraform plan for __EKS__
<details>
<summary>Plan: 72 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.education_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "education_cluster" {
+       access_config             = (known after apply)
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = (known after apply)
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       kubernetes_network_config = (known after apply)
+       name                      = "education-cluster"
+       outpost_config            = (known after apply)
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = (known after apply)
+       version                   = (known after apply)
+       vpc_config                = (known after apply)
    }

  # aws_iam_role_policy_attachment.blue_ebs_csi_role_policy_attach will be created
+   resource "aws_iam_role_policy_attachment" "blue_ebs_csi_role_policy_attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
+       role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.green_ebs_csi_role_policy_attach will be created
+   resource "aws_iam_role_policy_attachment" "green_ebs_csi_role_policy_attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
+       role       = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "aws-ebs-csi-driver"
+       id                 = (known after apply)
+       kubernetes_version = "1.28"
+       most_recent        = true
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "coredns"
+       id                 = (known after apply)
+       kubernetes_version = "1.28"
+       most_recent        = true
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "kube-proxy"
+       id                 = (known after apply)
+       kubernetes_version = "1.28"
+       most_recent        = true
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "vpc-cni"
+       id                 = (known after apply)
+       kubernetes_version = "1.28"
+       most_recent        = true
+       version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
+   resource "aws_cloudwatch_log_group" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/eks/education-cluster/cluster"
+       name_prefix       = (known after apply)
+       retention_in_days = 90
+       skip_destroy      = false
+       tags              = {
+           "Environment" = "education"
+           "Name"        = "/aws/eks/education-cluster/cluster"
+           "Terraform"   = "true"
        }
+       tags_all          = {
+           "Environment" = "education"
+           "Name"        = "/aws/eks/education-cluster/cluster"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Environment"
+       resource_id = (known after apply)
+       value       = "education"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Terraform"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Terraform"
+       resource_id = (known after apply)
+       value       = "true"
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "education-cluster"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = "arn:aws:iam::820116308106:role/admin"
+       tags              = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all          = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "education-cluster"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
+       principal_arn = "arn:aws:iam::820116308106:role/admin"

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "aws-ebs-csi-driver"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = "education-cluster"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "coredns"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = "education-cluster"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "kube-proxy"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = "education-cluster"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "vpc-cni"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = "education-cluster"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
+   resource "aws_eks_cluster" "this" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = [
+           "api",
+           "audit",
+           "authenticator",
        ]
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       name                      = "education-cluster"
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = {
+           "Environment"           = "education"
+           "Terraform"             = "true"
+           "terraform-aws-modules" = "eks"
        }
+       tags_all                  = {
+           "Environment"           = "education"
+           "Terraform"             = "true"
+           "owner"                 = "education-eks"
+           "terraform-aws-modules" = "eks"
        }
+       version                   = "1.28"

+       access_config {
+           authentication_mode                         = "API_AND_CONFIG_MAP"
+           bootstrap_cluster_creator_admin_permissions = false
        }

+       encryption_config {
+           resources = [
+               "secrets",
            ]

+           provider {
+               key_arn = (known after apply)
            }
        }

+       kubernetes_network_config {
+           ip_family         = "ipv4"
+           service_ipv4_cidr = (known after apply)
+           service_ipv6_cidr = (known after apply)
        }

+       timeouts {}

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = true
+           endpoint_public_access    = true
+           public_access_cidrs       = [
+               "0.0.0.0/0",
            ]
+           security_group_ids        = (known after apply)
+           subnet_ids                = (known after apply)
+           vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+   resource "aws_iam_openid_connect_provider" "oidc_provider" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags            = {
+           "Environment" = "education"
+           "Name"        = "education-cluster-eks-irsa"
+           "Terraform"   = "true"
        }
+       tags_all        = {
+           "Environment" = "education"
+           "Name"        = "education-cluster-eks-irsa"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
+       thumbprint_list = (known after apply)
+       url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
+   resource "aws_iam_policy" "cluster_encryption" {
+       arn         = (known after apply)
+       description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "education-cluster-cluster-ClusterEncryption"
+       path        = "/"
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
+                       Sid       = "EKSClusterAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "education-cluster-cluster-"
+       path                  = "/"
+       tags                  = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all              = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = "education-cluster-cluster"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "logs:CreateLogGroup",
                            ]
+                           Effect   = "Deny"
+                           Resource = "*"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.additional["policy_arn"] will be created
+   resource "aws_iam_role_policy_attachment" "additional" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
+   resource "aws_iam_role_policy_attachment" "cluster_encryption" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+       role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
+   resource "aws_security_group" "cluster" {
+       arn                    = (known after apply)
+       description            = "EKS cluster security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "education-cluster-cluster-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "education"
+           "Name"        = "education-cluster-cluster"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "education"
+           "Name"        = "education-cluster-cluster"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
+       vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node[0] will be created
+   resource "aws_security_group" "node" {
+       arn                    = (known after apply)
+       description            = "EKS node shared security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "education-cluster-node-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment"                             = "education"
+           "Name"                                    = "education-cluster-node"
+           "Terraform"                               = "true"
+           "kubernetes.io/cluster/education-cluster" = "owned"
        }
+       tags_all               = {
+           "Environment"                             = "education"
+           "Name"                                    = "education-cluster-node"
+           "Terraform"                               = "true"
+           "kubernetes.io/cluster/education-cluster" = "owned"
+           "owner"                                   = "education-eks"
        }
+       vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Node groups to cluster API"
+       from_port                = 443
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node groups"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 4443/tcp webhook"
+       from_port                = 4443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 4443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 6443/tcp webhook"
+       from_port                = 6443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 6443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 8443/tcp webhook"
+       from_port                = 8443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 8443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 9443/tcp webhook"
+       from_port                = 9443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 9443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node kubelets"
+       from_port                = 10250
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 10250
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node ingress on ephemeral ports"
+       from_port                = 1025
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 65535
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS UDP"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] will be created
+   resource "time_sleep" "this" {
+       create_duration = "30s"
+       id              = (known after apply)
+       triggers        = {
+           "cluster_certificate_authority_data" = (known after apply)
+           "cluster_endpoint"                   = (known after apply)
+           "cluster_name"                       = "education-cluster"
+           "cluster_service_cidr"               = (known after apply)
+           "cluster_version"                    = "1.28"
        }
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Name" = "education-vpc-eks-default"
        }
+       tags_all               = {
+           "Name"  = "education-vpc-eks-default"
+           "owner" = "education-eks"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       egress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       ingress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Name" = "education-vpc-eks-default"
        }
+       tags_all               = {
+           "Name"  = "education-vpc-eks-default"
+           "owner" = "education-eks"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "education-vpc-eks-default"
        }
+       tags_all               = {
+           "Name"  = "education-vpc-eks-default"
+           "owner" = "education-eks"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "education-vpc-eks-eu-west-1a"
        }
+       tags_all             = {
+           "Name"  = "education-vpc-eks-eu-west-1a"
+           "owner" = "education-eks"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "education-vpc-eks"
        }
+       tags_all = {
+           "Name"  = "education-vpc-eks"
+           "owner" = "education-eks"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "education-vpc-eks-eu-west-1a"
        }
+       tags_all                           = {
+           "Name"  = "education-vpc-eks-eu-west-1a"
+           "owner" = "education-eks"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "education-vpc-eks-private"
        }
+       tags_all         = {
+           "Name"  = "education-vpc-eks-private"
+           "owner" = "education-eks"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "education-vpc-eks-public"
        }
+       tags_all         = {
+           "Name"  = "education-vpc-eks-public"
+           "owner" = "education-eks"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                    = "education-vpc-eks-private-eu-west-1a"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/internal-elb"         = "1"
        }
+       tags_all                                       = {
+           "Name"                                    = "education-vpc-eks-private-eu-west-1a"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/internal-elb"         = "1"
+           "owner"                                   = "education-eks"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                    = "education-vpc-eks-private-eu-west-1b"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/internal-elb"         = "1"
        }
+       tags_all                                       = {
+           "Name"                                    = "education-vpc-eks-private-eu-west-1b"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/internal-elb"         = "1"
+           "owner"                                   = "education-eks"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.3.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                    = "education-vpc-eks-private-eu-west-1a"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/internal-elb"         = "1"
        }
+       tags_all                                       = {
+           "Name"                                    = "education-vpc-eks-private-eu-west-1a"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/internal-elb"         = "1"
+           "owner"                                   = "education-eks"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.4.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                    = "education-vpc-eks-public-eu-west-1a"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/elb"                  = "1"
        }
+       tags_all                                       = {
+           "Name"                                    = "education-vpc-eks-public-eu-west-1a"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/elb"                  = "1"
+           "owner"                                   = "education-eks"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.5.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                    = "education-vpc-eks-public-eu-west-1b"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/elb"                  = "1"
        }
+       tags_all                                       = {
+           "Name"                                    = "education-vpc-eks-public-eu-west-1b"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/elb"                  = "1"
+           "owner"                                   = "education-eks"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.6.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                    = "education-vpc-eks-public-eu-west-1a"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/elb"                  = "1"
        }
+       tags_all                                       = {
+           "Name"                                    = "education-vpc-eks-public-eu-west-1a"
+           "kubernetes.io/cluster/education-cluster" = "shared"
+           "kubernetes.io/role/elb"                  = "1"
+           "owner"                                   = "education-eks"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [tf-plan / Kabisa-playground-anas #16](https://github.com/anasgrt/eks_project/actions/runs/8767892424)